OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/pwm.c
/**************************************************************************//**
 * @file     pwm.c
 * @version  V1.00
 * $Revision: 5 $
 * $Date: 15/06/11 7:32p $
 * @brief    NUC970 series PWM driver source file
 *
 * @note
 * Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include "nuc970.h"
#include "sys.h"
#include "pwm.h"
/** @addtogroup NUC970_Device_Driver NUC970 Device Driver
  @{
*/

/** @addtogroup NUC970_PWM_Driver PWM Driver
  @{
*/


/** @addtogroup NUC970_PWM_EXPORTED_FUNCTIONS PWM Exported Functions
  @{
*/

//Internal function definition
/// @cond HIDDEN_SYMBOLS

void pwmISR(PVOID pvParam);


static INT pwmInitGPIO(const INT nTimerIdentity, const INT nValue);
static INT pwmInitTimer(const INT nTimerIdentity);
static INT pwmStartTimer(const INT nTimerIdentity);
static INT pwmStopTimer(const INT nTimerIdentity, const INT nMethod);
// Register operation
static INT pwmSetCP(const INT nTimerIdentity, const INT nValue);
static INT pwmSetDZI(const INT nTimerIdentity, const INT nValue);
static INT pwmSetCSR(const INT nTimerIdentity, const INT nValue);
static INT pwmSetDZGenerator(const INT nTimerIdentity, const INT nStatus);
static INT pwmSetTimerState(const INT nTimerIdentity, const INT nStatus);
static INT pwmSetInverter(const INT nTimerIdentity, const INT nStatus);
static INT pwmSetMode(const INT nTimerIdentity, const INT nStatus);
static INT pwmSetCNR(const INT nTimerIdentity, const INT nValue);
static INT pwmSetCMR(const INT nTimerIdentity, const INT nValue);
static UINT pwmGetPDR(const INT nTimerIdentity);
static INT pwmSetPIER(const INT nTimerIdentity, const INT value);
static INT pwmCleanPIIR(const INT nTimerIdentity);

//Global variable
static BOOL bPWMIRQFlag=FALSE;  //IRQ enable flag, set after PWM IRQ enable
static BOOL bPWMTimerOpenStatus[PWM_TIMER_NUM]; //timer flag which set after open(for disable IRQ decision)
static BOOL bPWMTimerStartStatus[PWM_TIMER_NUM]; //timer flag which set after Start count(to avoid incorrectly stop procedure)
static BOOL bPWMTimerMode[PWM_TIMER_NUM]; //PWM timer toggle/one shot mode
static BOOL volatile bPWMIntFlag[PWM_TIMER_NUM]; //interrupt flag which set by ISR
/// @endcond /* HIDDEN_SYMBOLS */


/**
  * @brief The init function of PWM device driver
  */
INT pwmInit(void)
{
    UINT temp;
    // Enable PWM clock
    temp = inpw(REG_CLK_PCLKEN1);
    temp = temp | 0x8000000;
    outpw(REG_CLK_PCLKEN1, temp);

    sysInstallISR(IRQ_LEVEL_1, PWM_IRQn, (PVOID)pwmISR);
    sysSetLocalInterrupt(ENABLE_IRQ);  // Enable CPSR I bit

    return 0;
}

/**
  * @brief The exit function of PWM device driver
  */
INT pwmExit(void)
{
    return 0;
}

/**
  * @brief The open function of PWM device driver
  * @param[in] nTimerIdentity PWM Timer channel identity
  * @retval Successful PWM successfully opened
  * @retval pwmTimerBusy PWM timer already open
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
INT pwmOpen(const INT nTimerIdentity)
{
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// nTimerIdentity value error
    }
    if(bPWMTimerOpenStatus[nTimerIdentity] == TRUE) {
        return pwmTimerBusy;
    }
    if(bPWMIRQFlag == FALSE) {

        sysEnableInterrupt(PWM_IRQn);

        bPWMIRQFlag=TRUE;
    }
    bPWMTimerOpenStatus[nTimerIdentity]=TRUE;

    // Set PWM timer default value(CSR->PPR->PCR->CMR->CNR)
    pwmInitTimer(nTimerIdentity);

    //Enable PIER
    pwmSetPIER(nTimerIdentity, PWM_ENABLE);

    //Reset PIIR
    pwmCleanPIIR(nTimerIdentity);

    //Reset PWM timer start count flag
    bPWMTimerStartStatus[nTimerIdentity] = FALSE;

    return Successful;

}

/**
  * @brief The close function of PWM device driver
  * @param[in] nTimerIdentity PWM Timer channel identity
  * @retval Successful PWM successfully closed
  * @retval pwmTimerNotOpen PWM timer not open
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
INT pwmClose(const INT nTimerIdentity)
{
    INT nLoop;
    BOOL uAllTimerClose=TRUE;
    if( nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX ) {
        return pwmInvalidTimerChannel;// nTimerIdentity value error
    }
    if(bPWMTimerOpenStatus[nTimerIdentity] == FALSE) {
        return pwmTimerNotOpen;
    }
    bPWMTimerOpenStatus[nTimerIdentity] = FALSE;
    //Check if all timer stop, IRQ can be disable
    for(nLoop=PWM_TIMER_MIN; nLoop<PWM_TIMER_NUM; nLoop++) {
        if(bPWMTimerOpenStatus[nLoop] == TRUE) {
            uAllTimerClose=FALSE;
        }
    }
    //All timer stop, disable IRQs
    if(uAllTimerClose == TRUE) {

        sysDisableInterrupt(PWM_IRQn);
        bPWMIRQFlag=FALSE;
    }

    pwmSetPIER(nTimerIdentity, PWM_DISABLE);
    pwmCleanPIIR(nTimerIdentity);


    return Successful;

}

/**
  * @brief The read function of PWM device driver
  * @param[in] nTimerIdentity PWM Timer channel identity
  * @param[out] pucStatusValue The point of typePWMSTATUS
  * @param[in] uLength The length of typePWMSTATUS
  * @retval Successful Read PWM value successfully
  * @retval pwmTimerNotOpen PWM timer not open
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidStructLength Struct length error(struct type error)
  */
INT pwmRead(const INT nTimerIdentity, PUCHAR pucStatusValue, const UINT uLength)
{
    if( nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX ) {
        return pwmInvalidTimerChannel;// nTimerIdentity value error
    }
    if(bPWMTimerOpenStatus[nTimerIdentity] == FALSE) {
        return pwmTimerNotOpen;
    }
    if(uLength != sizeof(typePWMSTATUS)) {
        return pwmInvalidStructLength;// Struct length error(struct type error)
    }
    if( sizeof(*((typePWMSTATUS *)pucStatusValue)) != sizeof(typePWMSTATUS) ) {
        return pwmInvalidStructLength;// Struct length error(struct type error)
    }
    ((typePWMSTATUS *)pucStatusValue)->PDR=pwmGetPDR(nTimerIdentity);
    if(bPWMIntFlag[nTimerIdentity] == TRUE) {
        bPWMIntFlag[nTimerIdentity]=FALSE;
        ((typePWMSTATUS *)pucStatusValue)->InterruptFlag=TRUE;
    } else {
        ((typePWMSTATUS *)pucStatusValue)->InterruptFlag=FALSE;
    }

    return Successful;

