OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/pwm.c
    if(nStatus != Successful) {
        return nStatus;
    }

    //Set PPR
    PWMPPR.value=(UINT)inpw(REG_PWM_PPR);
    switch(nTimerIdentity) {
    case PWM_TIMER0: {
        if(PWMPPR.field.cp0 == 0) {
            pwmSetCP(nTimerIdentity, DEFAULT_CP);
        }
        break;
    }
    case PWM_TIMER1: {
        if(PWMPPR.field.cp0 == 0) {
            pwmSetCP(nTimerIdentity, DEFAULT_CP);
        }
        break;
    }
    case PWM_TIMER2: {
        if(PWMPPR.field.cp1 == 0) {
            pwmSetCP(nTimerIdentity, DEFAULT_CP);
        }
        break;
    }
    case PWM_TIMER3: {
        if(PWMPPR.field.cp1 == 0) {
            pwmSetCP(nTimerIdentity, DEFAULT_CP);
        }
        break;
    }
    }

    //Set PCR
    nStatus=pwmSetMode(nTimerIdentity, DEFAULT_MODE);

    if(nStatus != Successful) {
        return nStatus;
    }
    bPWMTimerMode[nTimerIdentity] = DEFAULT_MODE;

    //Set CMR
    nStatus=pwmSetCMR(nTimerIdentity, DEFAULT_CMR);

    if(nStatus != Successful) {
        return nStatus;
    }

    //Set CNR
    nStatus=pwmSetCNR(nTimerIdentity, DEFAULT_CNR);

    if(nStatus != Successful) {
        return nStatus;
    }

    return Successful;

}


/**
  * @brief This function starts PWM timer according to the parameter
  * @param[in] nTimerIdentity Timer channel number
  * @retval Successful PWM start timer successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
static INT pwmStartTimer(const INT nTimerIdentity)
{
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// Timer_num value error
    }
    pwmSetTimerState(nTimerIdentity, PWM_ENABLE);
    if(bPWMTimerMode[nTimerIdentity] == PWM_TOGGLE) {
        bPWMTimerStartStatus[nTimerIdentity] = TRUE;
    }

    return Successful;
}

/**
  * @brief This function stops PWM timer n using method 1, 2, or 3 according to the
  *        parameter nTimerIdentity and nStatus
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nMethod Stop PWM timer method
  * @retval Successful PWM stop timer successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidStopMethod Stop method error
  */
static INT pwmStopTimer(const INT nTimerIdentity, INT nMethod)
{
    typeCNR PWMCNR;
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        // Timer_num value error
        return pwmInvalidTimerChannel;
    }
    //Can't stop before open PWM timer
    if(bPWMTimerOpenStatus[nTimerIdentity] == FALSE) {
        return Successful;
    }
    // one shot mode didn't need stop procedure
    if(bPWMTimerMode[nTimerIdentity] == PWM_ONESHOT) {
        return Successful;
    }
    // Timer stop already, no need to stop again
    if(bPWMTimerStartStatus[nTimerIdentity] == FALSE) {
        return Successful;
    }

    // Set CNR as 0
    PWMCNR.field.cnr=0;
    outpw(REG_PWM_CNR0+(PWM_OFFSET*nTimerIdentity), PWMCNR.value);

    switch(nMethod) {
    case PWM_STOP_METHOD1: {
        while(1) {
            if(pwmGetPDR(nTimerIdentity) == 0) { // Wait PDR reach to 0
                pwmSetTimerState(nTimerIdentity, PWM_DISABLE);// Disable pwm timer
                bPWMIntFlag[nTimerIdentity]=FALSE;
                bPWMTimerStartStatus[nTimerIdentity] = FALSE;
                break;
            }
        }
        break;
    }
    case PWM_STOP_METHOD2: {
        while(1) {
            if(bPWMIntFlag[nTimerIdentity] == TRUE) { // Wait interrupt happen
                pwmSetTimerState(nTimerIdentity, PWM_DISABLE);// Disable pwm timer
                bPWMIntFlag[nTimerIdentity] = FALSE;
                bPWMTimerStartStatus[nTimerIdentity] = FALSE;
                break;
            }
        }
        break;
    }
    /*case PWM_STOP_METHOD3:
    {
        pwmSetPCRState(nTimerIdentity, PWM_DISABLE);// Disable pwm timer
        bPWMIntFlag[nTimerIdentity] = FALSE;
        bPWMTimerStartStatus[nTimerIdentity] = FALSE;
        break;
    }*/
    default: {
        return pwmInvalidStopMethod;// Stop method value error
    }
    }

    return Successful;
}

/**
  * @brief This function set CPn value according to the parameter nTimerIdentity and nValue
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nValue The value which want to set in CSRn
  * @retval Successful Set CPn successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidCPValue PWM_PPR CPn value out of range
  */
static INT pwmSetCP(const INT nTimerIdentity, const INT nValue)
{
    typePPR PWMPPR;
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// Timer_num value error
    }
    if(nValue<CP_MIN || nValue>CP_MAX) {
        return pwmInvalidCPValue;// CP value error
    }
    PWMPPR.value=(UINT)inpw(REG_PWM_PPR);
    switch(nTimerIdentity) {
    case PWM_TIMER0: {
        PWMPPR.field.cp0=nValue;
        break;
    }
    case PWM_TIMER1: {
        PWMPPR.field.cp0=nValue;
        break;
    }
    case PWM_TIMER2: {
        PWMPPR.field.cp1=nValue;
        break;
    }
    case PWM_TIMER3: {
        PWMPPR.field.cp1=nValue;
        break;
    }
    }
    outpw(REG_PWM_PPR, PWMPPR.value);

    return Successful;
}

/**
  * @brief This function set DZIn value according to the parameter nTimerIdentity and nValue
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nValue The value which want to set in DZIn
  * @retval Successful Set DZIn successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidDZIValue PWM_PPR DZIn value out of range
  */
static INT pwmSetDZI(const INT nTimerIdentity, const INT nValue)
{
    typePPR PWMPPR;
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// Timer_num value error
    }
    if(nValue<DZI_MIN || nValue>DZI_MAX) {
        return pwmInvalidDZIValue;// CSR value error
    }
    PWMPPR.value=(UINT)inpw(REG_PWM_PPR);
    switch(nTimerIdentity) {
    case PWM_TIMER0: {
        PWMPPR.field.dzi0=nValue;
        break;
    }
    case PWM_TIMER1: {
        PWMPPR.field.dzi0=nValue;
        break;
    }
    case PWM_TIMER2: {
        PWMPPR.field.dzi1=nValue;
        break;
    }
    case PWM_TIMER3: {
        PWMPPR.field.dzi1=nValue;
        break;
    }
    }
    outpw(REG_PWM_PPR, PWMPPR.value);

    return Successful;
}

/**
  * @brief This function set CSRn value according to the parameter nTimerIdentity and nValue
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nValue The value which want to set in CSRn
  * @retval Successful Set CSRn successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
static INT pwmSetCSR(const INT nTimerIdentity, const INT nValue)
{
    typeCSR PWMCSR;
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// Timer_num value error
    }
    if(nValue<CSR_MIN || nValue>CSR_MAX) {
        return pwmInvalidCSRValue;// CSR value error
    }
    PWMCSR.value=(UINT)inpw(REG_PWM_CSR);
    switch(nTimerIdentity) {
    case PWM_TIMER0: {
        PWMCSR.field.csr0=nValue;
        break;
    }
    case PWM_TIMER1: {
        PWMCSR.field.csr1=nValue;
        break;
    }
    case PWM_TIMER2: {
        PWMCSR.field.csr2=nValue;
        break;
    }
    case PWM_TIMER3: {
        PWMCSR.field.csr3=nValue;
        break;
    }
    }
    outpw(REG_PWM_CSR, PWMCSR.value);

    return Successful;
}

/**
  * @brief This function enable/disable PWM channel n dead zone function according to the
  *        parameter nTimerIdentity and nStatus
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nStatus PWMDZG_ENABLE/PWMDZG_DISABLE
  * @retval Successful Set dead zone successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidDZGStatus PWM Dead-Zone Generator enable/disable status error
  */
static INT pwmSetDZGenerator(const INT nTimerIdentity, INT nStatus)
{
    typePCR PWMPCR;
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// Timer_num value error
    }
    if(nStatus != PWMDZG_ENABLE && nStatus != PWMDZG_DISABLE) {
        return pwmInvalidDZGStatus;// PCR inverter value error
    }
    PWMPCR.value=(UINT)inpw(REG_PWM_PCR);
    switch(nTimerIdentity) {
    case PWM_TIMER0: {
        PWMPCR.field.grpup0_dzen=nStatus;
        break;
    }
    case PWM_TIMER1: {
        PWMPCR.field.grpup0_dzen=nStatus;
        break;
    }
    case PWM_TIMER2: {
        PWMPCR.field.grpup1_dzen=nStatus;
        break;
    }
    case PWM_TIMER3: {
        PWMPCR.field.grpup1_dzen=nStatus;
        break;
    }
    }
    outpw(REG_PWM_PCR, PWMPCR.value);

    return Successful;
}

/**
  * @brief This function set PWM channel n enable/disable according to the
  *        parameter nTimerIdentity and nStatus
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nStatus PWM_ENABLE/PWMDISABLE
  * @retval Successful Set channel enable/disable successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
static INT pwmSetTimerState(const INT nTimerIdentity, INT nStatus)
{
    typePCR PWMPCR;
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// Timer_num value error
    }
    if(nStatus != PWM_ENABLE && nStatus != PWM_DISABLE) {
        return pwmInvalidTimerStatus;
    }
    PWMPCR.value=(UINT)inpw(REG_PWM_PCR);
    switch(nTimerIdentity) {
    case PWM_TIMER0: {
        PWMPCR.field.ch0_en=nStatus;
        break;
    }
    case PWM_TIMER1: {
        PWMPCR.field.ch1_en=nStatus;
        break;
    }
    case PWM_TIMER2: {
        PWMPCR.field.ch2_en=nStatus;
        break;
    }
    case PWM_TIMER3: {
        PWMPCR.field.ch3_en=nStatus;
        break;
    }
    }
    outpw(REG_PWM_PCR, PWMPCR.value);

    return Successful;
}


/**
  * @brief This function set PWM channel n inverter on/off according to the
  *        parameter nTimerIdentity and nStatus
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nStatus PWM_ENABLE/PWM_DISABLE
  * @retval Successful Set inverter successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidInverterValue Inverter value error
  */
static INT pwmSetInverter(const INT nTimerIdentity, INT nStatus)
{
    typePCR PWMPCR;
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// Timer_num value error
    }
    if(nStatus != PWM_INVON && nStatus != PWM_INVOFF) {
        return pwmInvalidInverterValue;// PCR inverter value error
    }
    PWMPCR.value=(UINT)inpw(REG_PWM_PCR);
    switch(nTimerIdentity) {
    case PWM_TIMER0: {
        PWMPCR.field.ch0_inverter=nStatus;
        break;
    }
    case PWM_TIMER1: {
        PWMPCR.field.ch1_inverter=nStatus;
        break;
    }
    case PWM_TIMER2: {
        PWMPCR.field.ch2_inverter=nStatus;
        break;
    }
    case PWM_TIMER3: {
        PWMPCR.field.ch3_inverter=nStatus;
        break;
    }
    }
    outpw(REG_PWM_PCR, PWMPCR.value);

    return Successful;
}

/**
  * @brief This function set PWM channel n toggle/one shot mode according to the
  *        parameter nTimerIdentity and nStatus
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nStatus PWM_TOGGLE/PWM_ONESHOT
  * @retval Successful Set operation mode successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidModeStatus Operating mode error
  */
static INT pwmSetMode(const INT nTimerIdentity, INT nStatus)
{
    typePCR PWMPCR;
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// Timer_num value error
    }
    if(nStatus != PWM_TOGGLE && nStatus != PWM_ONESHOT) {
        return pwmInvalidModeStatus;// PCR inverter value error
    }
    PWMPCR.value=(UINT)inpw(REG_PWM_PCR);
    switch(nTimerIdentity) {
    case PWM_TIMER0: {
        PWMPCR.field.ch0_mode=nStatus;
        break;
    }
    case PWM_TIMER1: {
        PWMPCR.field.ch1_mode=nStatus;
        break;
    }
    case PWM_TIMER2: {
        PWMPCR.field.ch2_mode=nStatus;
        break;
    }
    case PWM_TIMER3: {
        PWMPCR.field.ch3_mode=nStatus;
        break;
    }
    }
    outpw(REG_PWM_PCR, PWMPCR.value);
    bPWMTimerMode[nTimerIdentity] = nStatus;

    return Successful;
}


/**
  * @brief This function set PWM_CNRn value according to the parameter nTimerIdentity and nValue
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nValue CNR value
  * @retval Successful Set CNR successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidCNRValue Invalid CNR value
  */
static INT pwmSetCNR(const INT nTimerIdentity, INT nValue)
{
    typeCNR PWMCNR;
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// Timer_num value error
    }
    if(nValue < CNR_MIN || nValue > CNR_MAX) {
        return pwmInvalidCNRValue;// PCR inverter value error
    }
    PWMCNR.field.cnr=nValue;
    outpw(REG_PWM_CNR0+(PWM_OFFSET*nTimerIdentity), PWMCNR.value);

    return Successful;
}

/**
  * @brief This function set PWM_CMRn value according to the parameter nTimerIdentity and nValue
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nValue CMR value
  * @retval Successful Set CMR successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidCMRValue Invalid CMR value
  */
static INT pwmSetCMR(const INT nTimerIdentity, INT nValue)
{
    typeCMR PWMCMR;
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// Timer_num value error
    }
    if(nValue < CMR_MIN || nValue > CMR_MAX) {
        return pwmInvalidCMRValue;// CMR value error
    }
    PWMCMR.field.cmr=nValue;
    outpw(REG_PWM_CMR0+(PWM_OFFSET*nTimerIdentity), PWMCMR.value);

    return Successful;
}

/**
  * @brief This function return the PDR value of PWM timer n
  * @param[in] nTimerIdentity Timer channel number
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval Others Current PDR value
  */
static UINT pwmGetPDR(const INT nTimerIdentity)
{
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// Timer_num value error
    } else {
        return (UINT)inpw(REG_PWM_PDR0+(PWM_OFFSET*nTimerIdentity));// Return PDR value
    }
}

/**
  * @brief This function set the PIERn bit of PWM timer n as 1 or 0 according to the
  *        parameter nTimerIdentity and nValue
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nValue PWM_ENABLE/PWM_DISABLE
  * @retval Successful Set PIER successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
static INT pwmSetPIER(const INT nTimerIdentity, INT nValue)
{
    UINT uRegisterValue=0;;
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// Timer_num value error
    } else {
        uRegisterValue=(UINT)inpw(REG_PWM_PIER);
        if(nValue==PWM_ENABLE) {
            uRegisterValue=uRegisterValue|(1<<nTimerIdentity);// Set PIER
        } else {
            uRegisterValue=uRegisterValue&(0<<nTimerIdentity);// Clear PIER
        }
        outpw(REG_PWM_PIER, uRegisterValue);// Write value to PIER

        return Successful;
    }
}


/**
  * @brief This function clear PIIRn bit according to the parameter nTimerIdentity
  * @param[in] nTimerIdentity Timer channel number
  * @retval Successful Clear PIIR successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
static INT pwmCleanPIIR(const INT nTimerIdentity)
{
    UINT uRegisterValue=0;
    if(nTimerIdentity<PWM_TIMER_MIN || nTimerIdentity>PWM_TIMER_MAX) {
        return pwmInvalidTimerChannel;// nTimerIdentity value error
    }
    uRegisterValue=(UINT)inpw(REG_PWM_PIIR);
    uRegisterValue=uRegisterValue&~(1<<nTimerIdentity);
    outpw(REG_PWM_PIIR,uRegisterValue);

    return Successful;
}

/// @endcond /* HIDDEN_SYMBOLS */

/*@}*/ /* end of group NUC970_PWM_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NUC970_PWM_Driver */

/*@}*/ /* end of group NUC970_Device_Driver */

/*** (C) COPYRIGHT 2015 Nuvoton Technology Corp. ***/
